{"pageProps":{"post":{"attributes":{},"html":"<p>Hello! And welcome to the Complete Intro to SQLite, as taught by Brian Holt for Frontend Masters. In this course you will get learn the basics of SQL, the core features of SQLite, how to build a Node.js app with SQLite, what interesting and unique to SQLite as compared to other databases, some advance JSON ways to use SQLite, and what the future holds for SQLite with things like Litestream, LiteFS, and libSQL.</p>\n<h2>Who is this course for?</h2>\n<p>You, hopefully. This course shouldn&#39;t be your first exposure to programming or the command line, and it does use a bit of JavaScript so it would help if you knew bit of JavaScript. There&#39;s also some very light Docker use but I&#39;ll explain all of it so it&#39;s okay if you don&#39;t need Docker. Luckily I&#39;ve taught courses on these subjects if you want to brush up!</p>\n<ul>\n<li><a href=\"https://frontendmasters.com/courses/web-development-v3/\">Complete Intro to Web Dev</a></li>\n<li><a href=\"https://frontendmasters.com/courses/linux-command-line/\">Complete Intro to Linux and the CLI</a></li>\n<li><a href=\"https://frontendmasters.com/courses/complete-intro-containers-v2/\">Complete Intro to Containers</a></li>\n</ul>\n<p>These are great if you need help on any of those subjects. You do not any exposure to SQL prior to this course, the first part of it is basic querying in SQL. It is a brief intro, and if you want SQL, you can take my <a href=\"https://frontendmasters.com/courses/sql/\">Complete Intro to SQL</a> which uses Postgres but nearly all of it would apply to SQLite as well.</p>\n<h2>Who am I?</h2>\n<p><img src=\"/images/social-share-cover.jpg\" alt=\"Brian Holt\"></p>\n<p>My name is Brian and I am a staff product manager at <a href=\"https://neon.tech/\">Neon</a>. Neon is now my <em>third</em> database company I&#39;ve worked (fourth if you count Microsoft!) and I just love working developers and data. Have a good grasp of databases is essential to any app building and a little bit of skill and experience here will serve you well throughout your entire career!</p>\n<p>Prior to Neon, I&#39;ve work as a PM and engineer at SQLite Cloud, Snowflake, Stripe, Microsoft, LinkedIn, Netflix, Reddit, and some other smaller companies. I&#39;ve also been fortunate to teach at Frontend Masters a number of times and I&#39;ll keep doing it until they kick me out!</p>\n<p>I&#39;m a recent transplant to Sacramento, CA. Previous to that, I&#39;ve lived in Salt Lake City, San Francisco, Seattle, Montana, and northern Italy. When not teaching or working you&#39;ll find me snowboarding, playing Dota 2 poorly, drinking a cold beer, hot coffee, or smoky whisky, playing with my son and dog, and hacking on some side project for fun.</p>\n<p>Please catch up with me on social media, would love to chat. I will warn you: I am awful at responding to direct messages!</p>\n<ul>\n<li><a href=\"https://twitter.com/holtbt\">Twitter</a></li>\n<li><a href=\"https://github.com/btholt\">GitHub</a></li>\n<li><a href=\"https://www.linkedin.com/in/btholt/\">LinkedIn</a></li>\n</ul>\n<h2>What tools are your using?</h2>\n<ul>\n<li>Visual Studio Code – I used to work at Microsoft on VS Code so it&#39;s no surprise that I&#39;ll be using it in this course.</li>\n<li>Firefox – I want more than Chromium to exist so I support Firefox where I can. Feel free to use any browser; it won&#39;t matter in this course.</li>\n<li>Terminal.app – I used to use iTerm2 and Hyper but in the end I appreciate how fast the default terminal is.</li>\n<li>Docker Desktop – the last sections of the course lightly use Docker. Feel free to install it and follow along or just watch and read if you don&#39;t want to install Docker.</li>\n</ul>\n<h2>What &lt;font/theme/extension&gt; are you using?</h2>\n<ul>\n<li>Visual Studio Code<ul>\n<li>Dark+ Theme – It comes installed by default but it&#39;s not the default theme anymore. I&#39;m so used to it that I can&#39;t switch.</li>\n<li><a href=\"https://www.monolisa.dev/\">MonoLisa</a> font – I like fonts and I look at it all day so I was okay paying for it. I have <a href=\"https://worldofzero.com/posts/enable-font-ligatures-vscode/\">ligatures</a> enabled which is why you might see strange glyphs. If you want ligatures but don&#39;t want to pay, the linked ligature article has a few. I like Cascadia Code from Microsoft.</li>\n<li><a href=\"https://marketplace.visualstudio.com/items?itemName=vscode-icons-team.vscode-icons\">vscode-icons</a> – Lots of neat icons for VS Code and it&#39;s free.</li>\n</ul>\n</li>\n<li>Terminal<ul>\n<li>zsh – It comes with macOS now and I&#39;m <em>way</em> too lazy to switch back to bash.</li>\n<li><a href=\"https://draculatheme.com/terminal\">Dracula theme</a> – I like the pastels. I would use it in VS Code too if Dark+ wasn&#39;t ingrained in my blood.</li>\n<li><a href=\"https://starship.rs/\">Starship Prompt</a> – Very cool prompt that&#39;s just pretty. Also shows you what sort of project you&#39;re in which is occasionally useful</li>\n<li><a href=\"https://www.nerdfonts.com/font-downloads\">CaskaydiaCove Nerd Font</a> – This works with Starship prompt to give you the JS logos and all those extra glyphs. It&#39;s based on Cascadia Code.</li>\n</ul>\n</li>\n</ul>\n<h2>Where to File Issues</h2>\n<p>I write these courses and take care to avoid making mistakes. However, when teaching hours of material, mistakes are inevitable, both here in the grammar and in the course with the material. However, I (and the wonderful team at Frontend Masters) are constantly correcting the mistakes so that those of you that come later get the best product possible. If you find an error, we&#39;d love to fix it. The best way to do this is to <a href=\"https://github.com/btholt/complete-intro-to-sqlite/issues\">open a pull request or file an issue on the GitHub repo</a>. While I&#39;m always happy to chat and give advice on social media, I can&#39;t be tech support for everyone. And if you file it on GitHub, those who come later can Google the same answer you got.</p>\n<h2>Star this repo!</h2>\n<p>I would love it if you would take a sec and <a href=\"https://github.com/btholt/complete-intro-to-sqlite\">star the repo on GitHub</a></p>\n","markdown":"Hello! And welcome to the Complete Intro to SQLite, as taught by Brian Holt for Frontend Masters. In this course you will get learn the basics of SQL, the core features of SQLite, how to build a Node.js app with SQLite, what interesting and unique to SQLite as compared to other databases, some advance JSON ways to use SQLite, and what the future holds for SQLite with things like Litestream, LiteFS, and libSQL.\n\n## Who is this course for?\n\nYou, hopefully. This course shouldn't be your first exposure to programming or the command line, and it does use a bit of JavaScript so it would help if you knew bit of JavaScript. There's also some very light Docker use but I'll explain all of it so it's okay if you don't need Docker. Luckily I've taught courses on these subjects if you want to brush up!\n\n- [Complete Intro to Web Dev][web-dev]\n- [Complete Intro to Linux and the CLI][cli]\n- [Complete Intro to Containers][containers]\n\nThese are great if you need help on any of those subjects. You do not any exposure to SQL prior to this course, the first part of it is basic querying in SQL. It is a brief intro, and if you want SQL, you can take my [Complete Intro to SQL][sql] which uses Postgres but nearly all of it would apply to SQLite as well.\n\n## Who am I?\n\n![Brian Holt](/images/social-share-cover.jpg)\n\nMy name is Brian and I am a staff product manager at [Neon][neon]. Neon is now my _third_ database company I've worked (fourth if you count Microsoft!) and I just love working developers and data. Have a good grasp of databases is essential to any app building and a little bit of skill and experience here will serve you well throughout your entire career!\n\nPrior to Neon, I've work as a PM and engineer at SQLite Cloud, Snowflake, Stripe, Microsoft, LinkedIn, Netflix, Reddit, and some other smaller companies. I've also been fortunate to teach at Frontend Masters a number of times and I'll keep doing it until they kick me out!\n\nI'm a recent transplant to Sacramento, CA. Previous to that, I've lived in Salt Lake City, San Francisco, Seattle, Montana, and northern Italy. When not teaching or working you'll find me snowboarding, playing Dota 2 poorly, drinking a cold beer, hot coffee, or smoky whisky, playing with my son and dog, and hacking on some side project for fun.\n\nPlease catch up with me on social media, would love to chat. I will warn you: I am awful at responding to direct messages!\n\n- [Twitter][twitter]\n- [GitHub][github]\n- [LinkedIn][linkedin]\n\n## What tools are your using?\n\n- Visual Studio Code – I used to work at Microsoft on VS Code so it's no surprise that I'll be using it in this course.\n- Firefox – I want more than Chromium to exist so I support Firefox where I can. Feel free to use any browser; it won't matter in this course.\n- Terminal.app – I used to use iTerm2 and Hyper but in the end I appreciate how fast the default terminal is.\n- Docker Desktop – the last sections of the course lightly use Docker. Feel free to install it and follow along or just watch and read if you don't want to install Docker.\n\n## What <font/theme/extension> are you using?\n\n- Visual Studio Code\n  - Dark+ Theme – It comes installed by default but it's not the default theme anymore. I'm so used to it that I can't switch.\n  - [MonoLisa][monolisa] font – I like fonts and I look at it all day so I was okay paying for it. I have [ligatures][ligatures] enabled which is why you might see strange glyphs. If you want ligatures but don't want to pay, the linked ligature article has a few. I like Cascadia Code from Microsoft.\n  - [vscode-icons][vscode-icons] – Lots of neat icons for VS Code and it's free.\n- Terminal\n  - zsh – It comes with macOS now and I'm _way_ too lazy to switch back to bash.\n  - [Dracula theme][dracula] – I like the pastels. I would use it in VS Code too if Dark+ wasn't ingrained in my blood.\n  - [Starship Prompt][starship] – Very cool prompt that's just pretty. Also shows you what sort of project you're in which is occasionally useful\n  - [CaskaydiaCove Nerd Font][nerd] – This works with Starship prompt to give you the JS logos and all those extra glyphs. It's based on Cascadia Code.\n\n## Where to File Issues\n\nI write these courses and take care to avoid making mistakes. However, when teaching hours of material, mistakes are inevitable, both here in the grammar and in the course with the material. However, I (and the wonderful team at Frontend Masters) are constantly correcting the mistakes so that those of you that come later get the best product possible. If you find an error, we'd love to fix it. The best way to do this is to [open a pull request or file an issue on the GitHub repo][issue]. While I'm always happy to chat and give advice on social media, I can't be tech support for everyone. And if you file it on GitHub, those who come later can Google the same answer you got.\n\n## Star this repo!\n\nI would love it if you would take a sec and [star the repo on GitHub][star]\n\n[web-dev]: https://frontendmasters.com/courses/web-development-v3/\n[cli]: https://frontendmasters.com/courses/linux-command-line/\n[containers]: https://frontendmasters.com/courses/complete-intro-containers-v2/\n[sql]: https://frontendmasters.com/courses/sql/\n[neon]: https://neon.tech/\n[twitter]: https://twitter.com/holtbt\n[github]: https://github.com/btholt\n[linkedin]: https://www.linkedin.com/in/btholt/\n[ligatures]: https://worldofzero.com/posts/enable-font-ligatures-vscode/\n[monolisa]: https://www.monolisa.dev/\n[vscode-icons]: https://marketplace.visualstudio.com/items?itemName=vscode-icons-team.vscode-icons\n[dracula]: https://draculatheme.com/terminal\n[starship]: https://starship.rs/\n[nerd]: https://www.nerdfonts.com/font-downloads\n[issue]: https://github.com/btholt/complete-intro-to-sqlite/issues\n[star]: https://github.com/btholt/complete-intro-to-sqlite\n","slug":"intro","title":"Intro","section":"Welcome","icon":"info-circle","filePath":"/home/runner/work/complete-intro-to-sqlite/complete-intro-to-sqlite/lessons/01-welcome/A-intro.md","nextSlug":"/lessons/welcome/what-is-sqlite","prevSlug":null}},"__N_SSG":true}